PinguinoIDE/pinguino-compilers/linux64/p8/share/gputils/header/p18lf2550.inc
;----- CONFIG1H Options --------------------------------------------------
_FOSC_XT_XT_1H       EQU  H'F0'; XT oscillator (XT)
_FOSC_XTPLL_XT_1H    EQU  H'F2'; XT oscillator, PLL enabled (XTPLL)
_FOSC_ECIO_EC_1H     EQU  H'F4'; EC oscillator, port function on RA6 (ECIO)
_FOSC_EC_EC_1H       EQU  H'F5'; EC oscillator, CLKO function on RA6 (EC)
_FOSC_ECPLLIO_EC_1H  EQU  H'F6'; EC oscillator, PLL enabled, port function on RA6 (ECPIO)
_FOSC_ECPLL_EC_1H    EQU  H'F7'; EC oscillator, PLL enabled, CLKO function on RA6 (ECPLL)
_FOSC_INTOSCIO_EC_1H EQU  H'F8'; Internal oscillator, port function on RA6, EC used by USB (INTIO)
_FOSC_INTOSC_EC_1H   EQU  H'F9'; Internal oscillator, CLKO function on RA6, EC used by USB (INTCKO)
_FOSC_INTOSC_XT_1H   EQU  H'FA'; Internal oscillator, XT used by USB (INTXT)
_FOSC_INTOSC_HS_1H   EQU  H'FB'; Internal oscillator, HS oscillator used by USB (INTHS)
_FOSC_HS_1H          EQU  H'FC'; HS oscillator (HS)
_FOSC_HSPLL_HS_1H    EQU  H'FE'; HS oscillator, PLL enabled (HSPLL)

_FCMEN_OFF_1H        EQU  H'BF'; Fail-Safe Clock Monitor disabled
_FCMEN_ON_1H         EQU  H'FF'; Fail-Safe Clock Monitor enabled

_IESO_OFF_1H         EQU  H'7F'; Oscillator Switchover mode disabled
_IESO_ON_1H          EQU  H'FF'; Oscillator Switchover mode enabled

;----- CONFIG2L Options --------------------------------------------------
_PWRT_ON_2L          EQU  H'FE'; PWRT enabled
_PWRT_OFF_2L         EQU  H'FF'; PWRT disabled

_BOR_OFF_2L          EQU  H'F9'; Brown-out Reset disabled in hardware and software
_BOR_SOFT_2L         EQU  H'FB'; Brown-out Reset enabled and controlled by software (SBOREN is enabled)
_BOR_ON_ACTIVE_2L    EQU  H'FD'; Brown-out Reset enabled in hardware only and disabled in Sleep mode (SBOREN is disabled)
_BOR_ON_2L           EQU  H'FF'; Brown-out Reset enabled in hardware only (SBOREN is disabled)

_BORV_0_2L           EQU  H'E7'; Maximum setting
_BORV_1_2L           EQU  H'EF'
_BORV_2_2L           EQU  H'F7'
_BORV_3_2L           EQU  H'FF'; Minimum setting

_VREGEN_OFF_2L       EQU  H'DF'; USB voltage regulator disabled
_VREGEN_ON_2L        EQU  H'FF'; USB voltage regulator enabled

;----- CONFIG2H Options --------------------------------------------------
_WDT_OFF_2H          EQU  H'FE'; WDT disabled (control is placed on the SWDTEN bit)
_WDT_ON_2H           EQU  H'FF'; WDT enabled

_WDTPS_1_2H          EQU  H'E1'; 1:1
_WDTPS_2_2H          EQU  H'E3'; 1:2
_WDTPS_4_2H          EQU  H'E5'; 1:4
_WDTPS_8_2H          EQU  H'E7'; 1:8
_WDTPS_16_2H         EQU  H'E9'; 1:16
_WDTPS_32_2H         EQU  H'EB'; 1:32
_WDTPS_64_2H         EQU  H'ED'; 1:64
_WDTPS_128_2H        EQU  H'EF'; 1:128
_WDTPS_256_2H        EQU  H'F1'; 1:256
_WDTPS_512_2H        EQU  H'F3'; 1:512
_WDTPS_1024_2H       EQU  H'F5'; 1:1024
_WDTPS_2048_2H       EQU  H'F7'; 1:2048
_WDTPS_4096_2H       EQU  H'F9'; 1:4096
_WDTPS_8192_2H       EQU  H'FB'; 1:8192
_WDTPS_16384_2H      EQU  H'FD'; 1:16384
_WDTPS_32768_2H      EQU  H'FF'; 1:32768

;----- CONFIG3H Options --------------------------------------------------
_CCP2MX_OFF_3H       EQU  H'FE'; CCP2 input/output is multiplexed with RB3
_CCP2MX_ON_3H        EQU  H'FF'; CCP2 input/output is multiplexed with RC1

_PBADEN_OFF_3H       EQU  H'FD'; PORTB<4:0> pins are configured as digital I/O on Reset
_PBADEN_ON_3H        EQU  H'FF'; PORTB<4:0> pins are configured as analog input channels on Reset

_LPT1OSC_OFF_3H      EQU  H'FB'; Timer1 configured for higher power operation
_LPT1OSC_ON_3H       EQU  H'FF'; Timer1 configured for low-power operation

_MCLRE_OFF_3H        EQU  H'7F'; RE3 input pin enabled; MCLR pin disabled
_MCLRE_ON_3H         EQU  H'FF'; MCLR pin enabled; RE3 input pin disabled

;----- CONFIG4L Options --------------------------------------------------
_STVREN_OFF_4L       EQU  H'FE'; Stack full/underflow will not cause Reset
_STVREN_ON_4L        EQU  H'FF'; Stack full/underflow will cause Reset

_LVP_OFF_4L          EQU  H'FB'; Single-Supply ICSP disabled
_LVP_ON_4L           EQU  H'FF'; Single-Supply ICSP enabled

_XINST_OFF_4L        EQU  H'BF'; Instruction set extension and Indexed Addressing mode disabled (Legacy mode)
_XINST_ON_4L         EQU  H'FF'; Instruction set extension and Indexed Addressing mode enabled

_DEBUG_ON_4L         EQU  H'7F'; Background debugger enabled, RB6 and RB7 are dedicated to In-Circuit Debug
_DEBUG_OFF_4L        EQU  H'FF'; Background debugger disabled, RB6 and RB7 configured as general purpose I/O pins

;----- CONFIG5L Options --------------------------------------------------
_CP0_ON_5L           EQU  H'FE'; Block 0 (000800-001FFFh) is code-protected
_CP0_OFF_5L          EQU  H'FF'; Block 0 (000800-001FFFh) is not code-protected

_CP1_ON_5L           EQU  H'FD'; Block 1 (002000-003FFFh) is code-protected
_CP1_OFF_5L          EQU  H'FF'; Block 1 (002000-003FFFh) is not code-protected

_CP2_ON_5L           EQU  H'FB'; Block 2 (004000-005FFFh) is code-protected
_CP2_OFF_5L          EQU  H'FF'; Block 2 (004000-005FFFh) is not code-protected

_CP3_ON_5L           EQU  H'F7'; Block 3 (006000-007FFFh) is code-protected
_CP3_OFF_5L          EQU  H'FF'; Block 3 (006000-007FFFh) is not code-protected

;----- CONFIG5H Options --------------------------------------------------
_CPB_ON_5H           EQU  H'BF'; Boot block (000000-0007FFh) is code-protected
_CPB_OFF_5H          EQU  H'FF'; Boot block (000000-0007FFh) is not code-protected

_CPD_ON_5H           EQU  H'7F'; Data EEPROM is code-protected
_CPD_OFF_5H          EQU  H'FF'; Data EEPROM is not code-protected

;----- CONFIG6L Options --------------------------------------------------
_WRT0_ON_6L          EQU  H'FE'; Block 0 (000800-001FFFh) is write-protected
_WRT0_OFF_6L         EQU  H'FF'; Block 0 (000800-001FFFh) is not write-protected

_WRT1_ON_6L          EQU  H'FD'; Block 1 (002000-003FFFh) is write-protected
_WRT1_OFF_6L         EQU  H'FF'; Block 1 (002000-003FFFh) is not write-protected

_WRT2_ON_6L          EQU  H'FB'; Block 2 (004000-005FFFh) is write-protected
_WRT2_OFF_6L         EQU  H'FF'; Block 2 (004000-005FFFh) is not write-protected

_WRT3_ON_6L          EQU  H'F7'; Block 3 (006000-007FFFh) is write-protected
_WRT3_OFF_6L         EQU  H'FF'; Block 3 (006000-007FFFh) is not write-protected

